set minimal " howdy! take arms!"
# set medium "         ,*-." "         |##|" "     ,.  |##|" "     |#|_|##| ,.*" "     `---.##|_|#|" "         |##.--`" "    ႔ ႔  |##| ヘ( ^o^)ノ＼(^_^ )" " ᠸᵕ ᵕ  𐅠 |##| howdy partner! cacti!"
set medium "         ,*-." "         |  |" "     ,.  |  |" "     | |_|  | ,." "     `---.  |_| |" "         |  .--`" "    ႔ ႔  |  | ヘ( ^o^)ノ＼(^_^ )" " ᠸᵕ ᵕ  𐅠 |  | howdy partner! cacti!"
set large "  ⠀ ⠀⠀⠀⠀⠀ ⠀⠀⣀⣤⣴⡶⠾⠿⠿⠿⠿⠷⢶⣦⣤⣀⠀⠀⠀⠀⠀⠀⠀⠀" "    ⠀⠀⠀⠀⠀⢀⣴⡾⠛⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⢿⣦⣄⠀⠀⠀⠀⠀" "    ⠀⠀⠀⢀⣾⠟⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠻⣷⣄⠀⠀⠀" "    ⠀⠀⣰⡿⠃⠀⠀⠀⠀⠀⠀⠀⢠⣶⠿⣶⡀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢿⣦⠀⠀" "    ⠀⣰⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡏⠀⢸⡇⠀⣠⣤⣄⠀⠀⠀⠀⠀⠀⢻⣧⠀" "    ⢰⣿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡇⠀⢸⣿⢰⣿⠉⣿⡆⠀⠀⠀⠀⠀⠀⣿⡆" "    ⣾⡇⠀⠀⠀⠀⠀⠀⠀⣀⣀⡀⢸⡇⠀⢸⣿⢸⣿⠀⣿⡇⠀⠀⠀⠀⠀⠀⢸⣷" "    ⣿⡇⠀⠀⠀⠀⠀⠀⢠⣿⢹⣷⢸⡗⠀⢸⣿⢸⡿⠀⣿⡇⠀⠀⠀⠀⠀⠀⢸⣿" "    ⣿⡇⠀⠀⠀⠀⠀⠀⢸⣿⢸⣿⢸⡇⠀⠈⠿⡿⠃⠀⣿⠃⠀⠀⠀⠀⠀⠀⢸⣿" "    ⢸⣷⠀⠀⠀⠀⠀⠀⢸⣿⠈⣿⣸⣇⠀⠀⠀⠀⣀⣼⡟⠀⠀⠀⠀⠀⠀⠀⣾⡇" "    ⠀⢻⣇⠀⠀⠀⠀⠀⠀⣿⡄⠙⠿⠃⠀⢀⣾⠟⠛⠉⠀⠀⠀⠀⠀⠀⠀⣸⡟  ᕕ( ᐛ )ᕗ ᕕ( ᐕ )ᕗ" "    ⠀⠈⢻⣦⠀⠀⠀⠀⠀⠘⠻⢶⣶⡆⠀⢸⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⡟  (𝑻𝒂𝒚𝒍𝒐𝒓’𝒔 𝑽𝒆𝒓𝒔𝒊𝒐𝒏)" "    ⠀⠀⠀⠹⣷⣄⠀⠀⠀⠀⠀⠀⢸⡇⠀⢸⣿⠀⠀⠀⠀⠀⠀⠀⣠⣾⠏⠀ ദ്ദി(ᵔᗜᵔ) ٩(ˊᗜˋ*)و ⩜⃝" "    ⠀⠀⠀⠀⠈⠛⢷⣦⣀⠀⠀⠀⣸⡇⠀⢸⣿⠀⠀⠀⠀⣀⣴⡾⠛⠁ ( う-´)づ︻╦̵̵̿╤── \(˚☐˚”)/" "( ͠° ͟ʖ ͡°)⠀⠀⠀⠈⠛⠻⢷⡶⠿⠁⠀⠀⠻⣷⣶⡾⠟⠛⠁⠀⠀⚔ howdy partner! take arms!"
set xlarge " ⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣀⣤⣴⣶⣶⣾⣿⣿⣿⣿⣿⣿⣿⣶⣶⣦⣤⣄⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀" "  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣤⣶⣿⣿⣿⡿⠿⠟⠛⠛⠋⠉⠉⠉⠉⠉⠛⠛⠛⠿⢿⣿⣿⣿⣷⣦⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀" "  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣶⣿⣿⡿⠟⠛⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⠻⢿⣿⣿⣷⣤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀" "  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣴⣿⣿⡿⠛⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⠿⣿⣿⣶⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀" "  ⠀⠀⠀⠀⠀⠀⠀⠀⣠⣾⣿⣿⠟⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠻⢿⣿⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀" "  ⠀⠀⠀⠀⠀⠀⢀⣴⣿⣿⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢿⣿⣷⡄⠀⠀⠀⠀⠀⠀" "  ⠀⠀⠀⠀⠀⣠⣿⣿⡟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣴⣶⣶⣦⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠻⣿⣿⣆⠀⠀⠀⠀⠀" "  ⠀⠀⠀⠀⣴⣿⣿⠏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⡿⠟⠻⣿⣿⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⢿⣿⣧⡀⠀⠀⠀" "  ⠀⠀⠀⣼⣿⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⡇⠀⠀⠸⣿⣿⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢿⣿⣷⡀⠀⠀" "  ⠀⠀⣼⣿⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⡇⠀⠀⠀⣿⣿⡇⠀⠀⣴⣿⣿⣿⣷⣦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣿⣿⣧⠀⠀" "  ⠀⢰⣿⣿⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⡇⠀⠀⠀⣿⣿⡇⠀⢸⣿⣿⠋⠛⣿⣿⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣿⣿⡇⠀" "  ⠀⣿⣿⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⡇⠀⠀⠀⢻⣿⡇⠀⣼⣿⣿⠀⠀⢿⣿⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢹⣿⣿⡀" "  ⢸⣿⣿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⡇⠀⠀⠀⢸⣿⣧⠀⣿⣿⡟⠀⠀⢸⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣿⣿⡇" "  ⣼⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣴⣶⣶⣄⠀⠀⣿⣿⡇⠀⠀⠀⢸⣿⣿⠀⣿⣿⡇⠀⠀⢸⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣷" "  ⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⣿⠿⣿⣿⡇⠀⣿⣿⡇⠀⠀⠀⢸⣿⣿⠀⣿⣿⡇⠀⠀⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿" "  ⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣾⣿⡿⠀⣿⣿⣧⠀⣿⣿⡇⠀⠀⠀⢸⣿⣿⠀⣿⣿⡇⠀⠀⣿⣿⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿" "  ⣿⣿⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣇⠀⢻⣿⣿⠀⣿⣿⡇⠀⠀⠀⢸⣿⣿⣾⣿⣿⠁⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣾⣿⣿" "  ⢹⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⠀⢸⣿⣿⠀⣿⣿⡇⠀⠀⠀⠀⠙⠿⠿⠟⠁⠀⠀⢸⣿⣿⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⡇" "  ⠘⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢿⣿⣿⠀⢸⣿⣿⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⣿⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⠃" "  ⠀⢻⣿⣿⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⠀⠸⣿⣿⣆⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⢀⣠⣴⣿⣿⡿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣿⣿⡟⠀" "  ⠀⠈⣿⣿⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⡀⠀⠻⣿⣿⣿⣿⠇⠀⠀⠀⠀⣠⣾⣿⣿⣿⡿⠟⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⣿⠁⠀" "  ⠀⠀⠘⣿⣿⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢿⣿⣧⡀⠀⠈⠉⠉⠁⠀⠀⠀⠀⢸⣿⣿⠋⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⣿⠃⠀⠀" "  ⠀⠀⠀⠘⣿⣿⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢿⣿⣿⣶⣤⣤⣤⣄⠀⠀⠀⠀⢸⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⣿⠃⠀⠀⠀" "  ⠀⠀⠀⠀⠈⢿⣿⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⠿⠿⣿⣿⣿⠀⠀⠀⠀⢸⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣾⣿⡿⠃⠀⠀⠀⠀" "  ⠀⠀⠀⠀⠀⠀⠻⣿⣿⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⠀⠀⠀⠀⢸⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣿⣿⠟⠁⠀⠀\(˚☐˚”)/ ⁎४*✧⠀" "  ⠀⠀⠀⠀⠀⠀⠀⠘⢿⣿⣿⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⠀⠀⠀⠀⢸⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣿⣿⡿⠃⠀⠀ (•ω•)八(•ヮ•)⁎⠀⠀" "  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢿⣿⣿⣶⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⠀⠀⠀⠀⢸⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣶⣿⣿⡿⠋⠀  ᕕ( ᐛ )ᕗ ✧ᕕ( ᐕ )ᕗ⠀⠀" "  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠻⢿⣿⣿⣶⣤⣀⠀⠀⠀⠀⠀⢸⣿⣿⠃⠀⠀⠀⢸⣿⣿⠀⠀⠀⠀⠀⠀⠀⣀⣤⣶⣿⣿⡿⠟⠁⠀⠀ദ്ദി(ᵔᗜᵔ) ٩(ˊᗜˋ*)و ⩜⃝" "  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⠿⣿⣿⣿⣶⣦⣤⣴⣿⣿⠟⠀⠀⠀⠀⠘⣿⣿⣧⣄⣀⣤⣴⣶⣿⣿⣿⠿⠛⠉⠀⠀( う-´)づ︻╦̵̵̿╤── \(˚☐˚”)/" "  ( ⊙ _ ⊙)⠀   ⠀⠀⠀⠀⠀⠀⠉⠛⠻⠿⠿⠿⠟⠉⠀⠀⠀⠀⠀⠀⠈⠻⢿⣿⣿⣿⠿⠟⠛⠉⠀⠀⠀⚔ howdy partner! take arms!"

set -g prompt_color ffd700
set -g greeting_color a8bb4c
set -g left_buffer 1
set -g right_buffer 1

function max_length
    set curr_max 0
    for s in $argv[1..]
        set -l s_len (string length $s)
        if test $s_len -gt $curr_max
            set curr_max $s_len
        end
    end
    echo $curr_max
end

function parse_greeting
    set -g dir_length_full $argv[1]
    set -g pwd_on_final_line $argv[2]
    set -g image $argv[3..-2]
    set -g final_line $argv[-1]
    set current_prompt (prompt_pwd --full-length-dirs=$dir_length_full)
    set prompt_length (string length $current_prompt)
    set -g bumper (math $left_buffer + $right_buffer)
    set -g add_spaces ''
    set -g spaces 0
    if test (count $argv) -lt 3
        if test $COLUMNS -lt $prompt_length
            set -g final_image (set_color $prompt_color)(prompt_pwd --full-length-dirs=1)
        else
            set -g final_image (set_color $prompt_color)$current_prompt
        end
    else
        # else if test $PWD != $HOME
        if test $pwd_on_final_line -gt 0
            set -g final_line_raw_len (string length $final_line)
            set -g avail_space (math (math (math $COLUMNS - $final_line_raw_len) - $right_buffer) - $left_buffer)
            if test $avail_space -gt 0
                if test (string length (prompt_pwd --full-length-dirs=$dir_length_full)) -gt $avail_space
                    set short_current_prompt (prompt_pwd --full-length-dirs=1)
                    set short_prompt_length (string length $short_current_prompt)
                    if test $short_prompt_length -gt $avail_space
                        set diff (math $short_prompt_length - $avail_space)
                        if test $diff -gt (math $bumper + 1)
                            set short_current_prompt (string shorten -l -q -m$diff -- $current_prompt)
                            if test (count $short_current_prompt) -eq 0
                                set -g pwd_on_final_line 0
                            end
                        else
                            set -g pwd_on_final_line 0
                        end
                    end
                end
            end
        end
        if test $pwd_on_final_line -gt 0
            set current_prompt '> '$current_prompt
            if test (count $short_current_prompt) -gt 0
                set current_prompt (string join '…' $short_current_prompt)
            end
            set prompt_length (string length $current_prompt)
            set spaces (math (math $avail_space + $left_buffer) - $prompt_length)
            set add_spaces (string repeat -n $spaces ' ')
            if test (count $argv) -eq 3
                set -g final_image $final_line$add_spaces(set_color $prompt_color)$current_prompt
            else
                set -g final_line $final_line$add_spaces(set_color $prompt_color)$current_prompt
                set -g final_image $image $final_line
            end
        else
            set current_prompt '> '$current_prompt
            set extras (math max 0,(math (math $COLUMNS - $right_buffer) - (string length $current_prompt)))
            set extra_spaces ' '
            if test $extras -gt 0
                set extra_spaces (string repeat -n $extras ' ')
            end
            if test (count $argv) -eq 3
                set -g final_image $final_line $extra_spaces(set_color $prompt_color)$current_prompt
            else
                set -g final_image $image $final_line $extra_spaces(set_color $prompt_color)$current_prompt
            end
        end
    end
    set_color $greeting_color; printf '%s\n' $final_image
    set_color normal
end

if test $COLUMNS -gt (math (max_length $xlarge) + 12) && test $LINES -gt (math (count $xlarge) + 5)
    parse_greeting 3 1 $xlarge
else if test $COLUMNS -gt (math (max_length $large) + 12) && test $LINES -gt (math (count $large) + 5)
    parse_greeting 3 1 $large
else if test $COLUMNS -gt (math (max_length $medium) + 12) && test $LINES -gt (math (count $medium) + 5)
    parse_greeting 3 1 $medium
else
    parse_greeting 8 1 $minimal
end

# parse_greeting 3 1 $xlarge
# parse_greeting 3 1 $large
# parse_greeting 3 1 $medium
# parse_greeting 8 1 $minimal
